In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("../data/sales_data.csv")
df.head()

         Date Store   Category  Sales  Profit  Quantity
0  2024-01-01     A     Fruits   1660     431        34
1  2024-01-01     A     Snacks   4572     792        40
2  2024-01-01     A  Beverages   1266     200       106
3  2024-01-01     A      Dairy   4244     727       119
4  2024-01-01     A     Bakery    930     147        41

In [4]:
df.shape

(5475, 6)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5475 entries, 0 to 5474
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      5475 non-null   object
 1   Store     5475 non-null   object
 2   Category  5475 non-null   object
 3   Sales     5475 non-null   int64
 4   Profit    5475 non-null   int64
 5   Quantity  5475 non-null   int64
dtypes: int64(3), object(3)
memory usage: 256.8+ KB

In [6]:
df.isnull().sum()

Date        0
Store       0
Category    0
Sales       0
Profit      0
Quantity    0
dtype: int64

In [7]:
df['Date'] = pd.to_datetime(df['Date'])

In [8]:
df = df.sort_values("Date")

In [9]:
df.to_csv("../data/clean_sales.csv", index=False)
print("Clean data saved successfully!")

Clean data saved successfully!

In [10]:
clean_df = pd.read_csv("../data/clean_sales.csv")
clean_df.head()

         Date Store   Category  Sales  Profit  Quantity
0  2024-01-01     A     Fruits   1660     431        34
1  2024-01-01     C     Bakery   1400     328        79
2  2024-01-01     C      Dairy   3688     560        58
3  2024-01-01     C  Beverages   4356    1097        70
4  2024-01-01     C     Snacks   2067     454        83